In [2]:
import pandas as pd

In [3]:
df=pd.read_excel("Movie REVIEWS.xlsx")

In [4]:
df

   S.no Movie_name Ratings
0     1       KVPG  4 star
1     2     JERSEY  5 star
2     3        BBM  4 star
3     4          V  2 star
4     5        MCA  3 star

In [5]:
df.head()

   S.no Movie_name Ratings
0     1       KVPG  4 star
1     2     JERSEY  5 star
2     3        BBM  4 star
3     4          V  2 star
4     5        MCA  3 star

In [6]:
df['Ratings'].value_counts()

4 star    2
5 star    1
2 star    1
3 star    1
Name: Ratings, dtype: int64

In [ ]:
1 star-1
2 star-2
3 star-3
4 star-4
5 star-5

In [7]:
rp={'Ratings':
    {
    '1 star':1,
    '2 star':2,
    '3 star':3,
    '4 star':4,
    '5 star':5}}

In [8]:
new=df.replace(rp)

In [9]:
new

   S.no Movie_name  Ratings
0     1       KVPG        4
1     2     JERSEY        5
2     3        BBM        4
3     4          V        2
4     5        MCA        3

In [10]:
encode={'Ratings':
    {
    '1 star':1,
    '2 star':2,
    '3 star':3,
    '4 star':4,
    '5 star':5}}

In [11]:
encode

{'Ratings': {'1 star': 1, '2 star': 2, '3 star': 3, '4 star': 4, '5 star': 5}}

In [12]:
new.head()

   S.no Movie_name  Ratings
0     1       KVPG        4
1     2     JERSEY        5
2     3        BBM        4
3     4          V        2
4     5        MCA        3

In [13]:
new_df=df.replace(encode)

In [14]:
new_df

   S.no Movie_name  Ratings
0     1       KVPG        4
1     2     JERSEY        5
2     3        BBM        4
3     4          V        2
4     5        MCA        3

In [15]:
encoded_df=df.replace(encode)

In [16]:
output=encoded_df.to_excel('data.xlsx')

In [17]:
pd.read_excel('data.xlsx')

   Unnamed: 0  S.no Movie_name  Ratings
0           0     1       KVPG        4
1           1     2     JERSEY        5
2           2     3        BBM        4
3           3     4          V        2
4           4     5        MCA        3

In [18]:
df.head(3)

   S.no Movie_name Ratings
0     1       KVPG  4 star
1     2     JERSEY  5 star
2     3        BBM  4 star

In [19]:
new.head()

   S.no Movie_name  Ratings
0     1       KVPG        4
1     2     JERSEY        5
2     3        BBM        4
3     4          V        2
4     5        MCA        3

In [20]:
type(df['Ratings'])

pandas.core.series.Series

In [21]:
df.info

<bound method DataFrame.info of    S.no Movie_name Ratings
0     1       KVPG  4 star
1     2     JERSEY  5 star
2     3        BBM  4 star
3     4          V  2 star
4     5        MCA  3 star>

In [22]:
df['Ratings']=df['Ratings'].astype('category')

In [23]:
df.dtypes

S.no             int64
Movie_name      object
Ratings       category
dtype: object

In [24]:
df['Ratings_new']=df['Ratings'].cat.codes

In [ ]:
#convert my category values from 0 to n
'''ratings-category
2 star-0
3 star-1
4 star-2
5 star-3'''

In [25]:
df

   S.no Movie_name Ratings  Ratings_new
0     1       KVPG  4 star            2
1     2     JERSEY  5 star            3
2     3        BBM  4 star            2
3     4          V  2 star            0
4     5        MCA  3 star            1

In [26]:
pd.get_dummies(df, columns=["Ratings"]).head()
#it gives dummy data

,S.no,Movie_name,Ratings_new,Ratings_2 star,Ratings_3 star,Ratings_4 star,Ratings_5 star
0,1,KVPG,2,0,0,1,0
1,2,JERSEY,3,0,0,0,1
2,3,BBM,2,0,0,1,0
3,4,V,0,1,0,0,0
4,5,MCA,1,0,1,0,0

In [27]:
from sklearn.preprocessing import OrdinalEncoder

In [28]:
obj=OrdinalEncoder()#creating object of encoder

In [29]:
df['encode']=obj.fit_transform(df[['Ratings']])

In [30]:
df.head()

   S.no Movie_name Ratings  Ratings_new  encode
0     1       KVPG  4 star            2     2.0
1     2     JERSEY  5 star            3     3.0
2     3        BBM  4 star            2     2.0
3     4          V  2 star            0     0.0
4     5        MCA  3 star            1     1.0

In [31]:
df.value_counts

<bound method DataFrame.value_counts of    S.no Movie_name Ratings  Ratings_new  encode
0     1       KVPG  4 star            2     2.0
1     2     JERSEY  5 star            3     3.0
2     3        BBM  4 star            2     2.0
3     4          V  2 star            0     0.0
4     5        MCA  3 star            1     1.0>